SkydiverMCU/mcu-iap-demo/STAR-MC1/MM32F5370/USB_Custom_HID/MM32F5370_HID_Application/Device/MM32F5370/Include/reg_usbfs.h
/**
  * @brief USBFS_BDTPAGE1 Register Bit Definition
  */
#define  USBFS_BDTPAGE1_BDT_BA_Pos                (1)
#define  USBFS_BDTPAGE1_BDT_BA_Msk                (0x7FU << USBFS_BDTPAGE1_BDT_BA_Pos)              /*!<This 7 bit value provides address bits 15 through 9 of the BDT base address, which defines where the Buffer Descriptor Table resides at in system memory. The 32 bit BDT base address is always aligned on 512 byte boundaries in memory.*/
#define  USBFS_BDTPAGE1_BDT_BA                    USBFS_BDTPAGE1_BDT_BA_Msk
#define  USBFS_BDTPAGE1_BDT_BA_Bit0               (0x01U << USBFS_BDTPAGE1_BDT_BA_Pos) 
#define  USBFS_BDTPAGE1_BDT_BA_Bit1               (0x02U << USBFS_BDTPAGE1_BDT_BA_Pos) 
#define  USBFS_BDTPAGE1_BDT_BA_Bit2               (0x04U << USBFS_BDTPAGE1_BDT_BA_Pos) 
#define  USBFS_BDTPAGE1_BDT_BA_Bit3               (0x08U << USBFS_BDTPAGE1_BDT_BA_Pos) 
#define  USBFS_BDTPAGE1_BDT_BA_Bit4               (0x10U << USBFS_BDTPAGE1_BDT_BA_Pos) 
#define  USBFS_BDTPAGE1_BDT_BA_Bit5               (0x20U << USBFS_BDTPAGE1_BDT_BA_Pos) 
#define  USBFS_BDTPAGE1_BDT_BA_Bit6               (0x40U << USBFS_BDTPAGE1_BDT_BA_Pos) 

/**
  * @brief USBFS_FRMNUML Register Bit Definition
  */
#define  USBFS_FRMNUML_FRM_Pos                    (0)
#define  USBFS_FRMNUML_FRM_Msk                    (0xFFU << USBFS_FRMNUML_FRM_Pos)                  /*!<These bits indicate the low 8 bits of the 11 bit frame.*/
#define  USBFS_FRMNUML_FRM                        USBFS_FRMNUML_FRM_Msk
#define  USBFS_FRMNUML_FRM_Bit0                   (0x01U << USBFS_FRMNUML_FRM_Pos) 
#define  USBFS_FRMNUML_FRM_Bit1                   (0x02U << USBFS_FRMNUML_FRM_Pos) 
#define  USBFS_FRMNUML_FRM_Bit2                   (0x04U << USBFS_FRMNUML_FRM_Pos) 
#define  USBFS_FRMNUML_FRM_Bit3                   (0x08U << USBFS_FRMNUML_FRM_Pos) 
#define  USBFS_FRMNUML_FRM_Bit4                   (0x10U << USBFS_FRMNUML_FRM_Pos) 
#define  USBFS_FRMNUML_FRM_Bit5                   (0x20U << USBFS_FRMNUML_FRM_Pos) 
#define  USBFS_FRMNUML_FRM_Bit6                   (0x40U << USBFS_FRMNUML_FRM_Pos) 
#define  USBFS_FRMNUML_FRM_Bit7                   (0x80U << USBFS_FRMNUML_FRM_Pos) 

/**
  * @brief USBFS_FRMNUMH Register Bit Definition
  */
#define  USBFS_FRMNUMH_FRM_Pos                    (0)
#define  USBFS_FRMNUMH_FRM_Msk                    (0x7U << USBFS_FRMNUMH_FRM_Pos)                   /*!<These bits indicate the high 3 bits of the 11 bit frame.*/
#define  USBFS_FRMNUMH_FRM                        USBFS_FRMNUMH_FRM_Msk
#define  USBFS_FRMNUMH_FRM_Bit0                   (0x1U << USBFS_FRMNUMH_FRM_Pos) 
#define  USBFS_FRMNUMH_FRM_Bit1                   (0x2U << USBFS_FRMNUMH_FRM_Pos) 
#define  USBFS_FRMNUMH_FRM_Bit2                   (0x4U << USBFS_FRMNUMH_FRM_Pos) 

/**
  * @brief USBFS_TOKEN Register Bit Definition
  */
#define  USBFS_TOKEN_TOKEN_ENDPT_Pos              (0)
#define  USBFS_TOKEN_TOKEN_ENDPT_Msk              (0xFU << USBFS_TOKEN_TOKEN_ENDPT_Pos)             /*!<Set the End Point of communication with the device.*/
#define  USBFS_TOKEN_TOKEN_ENDPT                  USBFS_TOKEN_TOKEN_ENDPT_Msk
#define  USBFS_TOKEN_TOKEN_ENDPT_Bit0             (0x1U << USBFS_TOKEN_TOKEN_ENDPT_Pos) 
#define  USBFS_TOKEN_TOKEN_ENDPT_Bit1             (0x2U << USBFS_TOKEN_TOKEN_ENDPT_Pos) 
#define  USBFS_TOKEN_TOKEN_ENDPT_Bit2             (0x4U << USBFS_TOKEN_TOKEN_ENDPT_Pos) 
#define  USBFS_TOKEN_TOKEN_ENDPT_Bit3             (0x8U << USBFS_TOKEN_TOKEN_ENDPT_Pos) 
#define  USBFS_TOKEN_TOKEN_PID_Pos                (4)
#define  USBFS_TOKEN_TOKEN_PID_Msk                (0xFU << USBFS_TOKEN_TOKEN_PID_Pos)               /*!<Set the executed token type, valid token*/
#define  USBFS_TOKEN_TOKEN_PID                    USBFS_TOKEN_TOKEN_PID_Msk
#define  USBFS_TOKEN_TOKEN_PID_Bit0               (0x1U << USBFS_TOKEN_TOKEN_PID_Pos) 
#define  USBFS_TOKEN_TOKEN_PID_Bit1               (0x2U << USBFS_TOKEN_TOKEN_PID_Pos) 
#define  USBFS_TOKEN_TOKEN_PID_Bit2               (0x4U << USBFS_TOKEN_TOKEN_PID_Pos) 
#define  USBFS_TOKEN_TOKEN_PID_Bit3               (0x8U << USBFS_TOKEN_TOKEN_PID_Pos) 

/**
  * @brief USBFS_SOFTHLD Register Bit Definition
  */
#define  USBFS_SOFTHLD_CNT_Pos                    (0)
#define  USBFS_SOFTHLD_CNT_Msk                    (0xFFU << USBFS_SOFTHLD_CNT_Pos)                  /*!<Set SOF count threshold.*/
#define  USBFS_SOFTHLD_CNT                        USBFS_SOFTHLD_CNT_Msk
#define  USBFS_SOFTHLD_CNT_Bit0                   (0x01U << USBFS_SOFTHLD_CNT_Pos) 
#define  USBFS_SOFTHLD_CNT_Bit1                   (0x02U << USBFS_SOFTHLD_CNT_Pos) 
#define  USBFS_SOFTHLD_CNT_Bit2                   (0x04U << USBFS_SOFTHLD_CNT_Pos) 
#define  USBFS_SOFTHLD_CNT_Bit3                   (0x08U << USBFS_SOFTHLD_CNT_Pos) 
#define  USBFS_SOFTHLD_CNT_Bit4                   (0x10U << USBFS_SOFTHLD_CNT_Pos) 
#define  USBFS_SOFTHLD_CNT_Bit5                   (0x20U << USBFS_SOFTHLD_CNT_Pos) 
#define  USBFS_SOFTHLD_CNT_Bit6                   (0x40U << USBFS_SOFTHLD_CNT_Pos) 
#define  USBFS_SOFTHLD_CNT_Bit7                   (0x80U << USBFS_SOFTHLD_CNT_Pos) 

/**
  * @brief USBFS_BDTPAGE2 Register Bit Definition
  */
#define  USBFS_BDTPAGE2_BDT_BA_Pos                (0)
#define  USBFS_BDTPAGE2_BDT_BA_Msk                (0xFFU << USBFS_BDTPAGE2_BDT_BA_Pos)              /*!<This 8 bit value provides address bits 23 through 16 of the BDT base address, which defines where the Buffer Descriptor Table resides at in system memory. The 32 bit BDT base address is always aligned on 512 byte boundaries in memory.*/
#define  USBFS_BDTPAGE2_BDT_BA                    USBFS_BDTPAGE2_BDT_BA_Msk
#define  USBFS_BDTPAGE2_BDT_BA_Bit0               (0x01U << USBFS_BDTPAGE2_BDT_BA_Pos) 
#define  USBFS_BDTPAGE2_BDT_BA_Bit1               (0x02U << USBFS_BDTPAGE2_BDT_BA_Pos) 
#define  USBFS_BDTPAGE2_BDT_BA_Bit2               (0x04U << USBFS_BDTPAGE2_BDT_BA_Pos) 
#define  USBFS_BDTPAGE2_BDT_BA_Bit3               (0x08U << USBFS_BDTPAGE2_BDT_BA_Pos) 
#define  USBFS_BDTPAGE2_BDT_BA_Bit4               (0x10U << USBFS_BDTPAGE2_BDT_BA_Pos) 
#define  USBFS_BDTPAGE2_BDT_BA_Bit5               (0x20U << USBFS_BDTPAGE2_BDT_BA_Pos) 
#define  USBFS_BDTPAGE2_BDT_BA_Bit6               (0x40U << USBFS_BDTPAGE2_BDT_BA_Pos) 
#define  USBFS_BDTPAGE2_BDT_BA_Bit7               (0x80U << USBFS_BDTPAGE2_BDT_BA_Pos) 

/**
  * @brief USBFS_BDTPAGE3 Register Bit Definition
  */
#define  USBFS_BDTPAGE3_BDT_BA_Pos                (0)
#define  USBFS_BDTPAGE3_BDT_BA_Msk                (0xFFU << USBFS_BDTPAGE3_BDT_BA_Pos)              /*!<This 8 bit value provides address bits 31 through 24 of the BDT base address, which defines where the Buffer Descriptor Table resides at in system memory. The 32 bit BDT base address is always aligned on 512 byte boundaries in memory.*/
#define  USBFS_BDTPAGE3_BDT_BA                    USBFS_BDTPAGE3_BDT_BA_Msk
#define  USBFS_BDTPAGE3_BDT_BA_Bit0               (0x01U << USBFS_BDTPAGE3_BDT_BA_Pos) 
#define  USBFS_BDTPAGE3_BDT_BA_Bit1               (0x02U << USBFS_BDTPAGE3_BDT_BA_Pos) 
#define  USBFS_BDTPAGE3_BDT_BA_Bit2               (0x04U << USBFS_BDTPAGE3_BDT_BA_Pos) 
#define  USBFS_BDTPAGE3_BDT_BA_Bit3               (0x08U << USBFS_BDTPAGE3_BDT_BA_Pos) 
#define  USBFS_BDTPAGE3_BDT_BA_Bit4               (0x10U << USBFS_BDTPAGE3_BDT_BA_Pos) 
#define  USBFS_BDTPAGE3_BDT_BA_Bit5               (0x20U << USBFS_BDTPAGE3_BDT_BA_Pos) 
#define  USBFS_BDTPAGE3_BDT_BA_Bit6               (0x40U << USBFS_BDTPAGE3_BDT_BA_Pos) 
#define  USBFS_BDTPAGE3_BDT_BA_Bit7               (0x80U << USBFS_BDTPAGE3_BDT_BA_Pos) 

/**
  * @brief USBFS_EPCTL Register Bit Definition
  */
#define  USBFS_EPCTL_EP_HSHK_Pos                  (0)
#define  USBFS_EPCTL_EP_HSHK_Msk                  (0x1U << USBFS_EPCTL_EP_HSHK_Pos)                 /*!<0: This End Point doesn't return handshake signal*/
#define  USBFS_EPCTL_EP_HSHK                      USBFS_EPCTL_EP_HSHK_Msk
#define  USBFS_EPCTL_EP_STALL_Pos                 (1)
#define  USBFS_EPCTL_EP_STALL_Msk                 (0x1U << USBFS_EPCTL_EP_STALL_Pos)                /*!<Superior to EP_HSHK bit setting, and only valid when the end point is not disabled.*/
#define  USBFS_EPCTL_EP_STALL                     USBFS_EPCTL_EP_STALL_Msk
#define  USBFS_EPCTL_EP_TX_EN_Pos                 (2)
#define  USBFS_EPCTL_EP_TX_EN_Msk                 (0x1U << USBFS_EPCTL_EP_TX_EN_Pos)                /*!<Endpoint send enable bit*/
#define  USBFS_EPCTL_EP_TX_EN                     USBFS_EPCTL_EP_TX_EN_Msk
#define  USBFS_EPCTL_EP_RX_EN_Pos                 (3)
#define  USBFS_EPCTL_EP_RX_EN_Msk                 (0x1U << USBFS_EPCTL_EP_RX_EN_Pos)                /*!<Endpoint receive enable bit*/
#define  USBFS_EPCTL_EP_RX_EN                     USBFS_EPCTL_EP_RX_EN_Msk
#define  USBFS_EPCTL_EP_CTL_DIS_Pos               (4)
#define  USBFS_EPCTL_EP_CTL_DIS_Msk               (0x1U << USBFS_EPCTL_EP_CTL_DIS_Pos)              /*!<Endpoint transmission direction bit*/
#define  USBFS_EPCTL_EP_CTL_DIS                   USBFS_EPCTL_EP_CTL_DIS_Msk
#define  USBFS_EPCTL_RETRY_DIS_Pos                (6)
#define  USBFS_EPCTL_RETRY_DIS_Msk                (0x1U << USBFS_EPCTL_RETRY_DIS_Pos)               /*!<This is a bit only used in the host mode, only existing in the End Point 1 control register.*/
#define  USBFS_EPCTL_RETRY_DIS                    USBFS_EPCTL_RETRY_DIS_Msk
#define  USBFS_EPCTL_HOST_WO_HUB_Pos              (7)
#define  USBFS_EPCTL_HOST_WO_HUB_Msk              (0x1U << USBFS_EPCTL_HOST_WO_HUB_Pos)             /*!<This is a bit only used in the host mode, only existing in the End Point x control register.*/
#define  USBFS_EPCTL_HOST_WO_HUB                  USBFS_EPCTL_HOST_WO_HUB_Msk

/**
  * @brief USBFS_USBCTRL Register Bit Definition
  */
#define  USBFS_USBCTRL_VBUSORV_Pos                (0)
#define  USBFS_USBCTRL_VBUSORV_Msk                (0x1U << USBFS_USBCTRL_VBUSORV_Pos)               /*!<VBUS value, only valid when VBUSORE=1*/
#define  USBFS_USBCTRL_VBUSORV                    USBFS_USBCTRL_VBUSORV_Msk
#define  USBFS_USBCTRL_VBUSORE_Pos                (1)
#define  USBFS_USBCTRL_VBUSORE_Msk                (0x1U << USBFS_USBCTRL_VBUSORE_Pos)               /*!<VBUS Override Enable. When VBUS is rewritten to 0, the DP pull-up will be automatically invalid, and if it is rewritten to 1, the DP pull-up resistor will be automatically valid*/
#define  USBFS_USBCTRL_VBUSORE                    USBFS_USBCTRL_VBUSORE_Msk
#define  USBFS_USBCTRL_SUSPE_Pos                  (7)
#define  USBFS_USBCTRL_SUSPE_Msk                  (0x1U << USBFS_USBCTRL_SUSPE_Pos)                 /*!<The on-chip USB PHY suspend state enable bit is used when the USB controller is in the suspend state. Setting this bit can make the on-chip PHY in the suspend state, further saving power consumption. Clearing this bit puts the on-chip USB PHY in normal operation. When SUSPE=1, the Resume or Remote Wakeup operation is allowed to wake the system from STOP mode.*/
#define  USBFS_USBCTRL_SUSPE                      USBFS_USBCTRL_SUSPE_Msk


#endif

